p = [0:0.005:0.5];
C = (1 + (1 - p) .* log2(1 - p) + p .* log2(p)) * 3;
I_out = -(3 * p.^2 - 3 * p + 1) .* log2((3 * p.^2 - 3 * p + 1) / 2) ...
    - 3 * (1 - p) .* p .* log2((1 - p) .* p / 2) ...
    + (1 - p).^3 .* log2((1 - p).^3) + p.^3 .* log2(p.^3) ...
    + 3 * (1 - p).^2 .* p .* log2((1 - p).^2 .* p) ...
    + 3 * (1 - p) .* p.^2 .* log2((1 - p) .* p.^2);
I_t = 1 + ((1 - p).^2 .* (1 + 2 * p)) .* log2((1 - p).^2 .* (1 + 2 * p)) ...
    + (p.^2 .* (3 - 2 * p)) .* log2(p.^2 .* (3 - 2 * p));
I_e = -(3 * p.^2 - 3 * p + 1) .* log2((3 * p.^2 - 3 * p + 1) / 2) ...
    + (1 - p).^3 .* log2((1 - p).^3) + p.^3 .* log2(p.^3);


figure;
hold on;
plot(p, C, 'g');
plot(p, I_out, 'k');
plot(p, I_t, 'b');
plot(p, I_e, 'r');
set(gca(), 'YScale', 'log');
legend('每块信道容量', '信道输出的信息量', '纠错获得的信息量', '检错获得的信息量');
xlabel('信道误符号率');
ylabel('每块获得信息量');
